
# Константи
rigDepth = 1800.0; # Глибина свердловини
p = 1300.0;        # Густина розчину
Step = 150.0;      # Крок
g = 9.81;          # Швидкість вільного падіння

# Змінні
Pressure = 0.0;          # Тиск рідини
h = 0.0;                 # Глибина

# Виведення назв стовпців з форматуванням
print(f"\t| {'Тиск в Па':18}{'|':6}{'Тиск в MПа':14}{'|':6}{'Глибина':7}|")
while(True):
    if (h>rigDepth):  # Глибина > глибини свердловини - вихід з циклу
        print("\t------------------------------------------------------") 
        break;
  
    else:  # Обчислення проводяться поки - глибина <= глибини свердловини 
        Pressure = p * g * h;  # Обчислення тиску рідини
        print("\t|----------------------------------------------------|")
        print(f"\t|{Pressure:13.2f}{'':6}|{Pressure/1000000.0:13.2f}{'':6}|{h:12.2f}|")
        h += Step;
